/*----------------------------------------------------------------------------------------------------------
author:	ZHANGSHAOHAN
created:	2009/09/14
-----------------------------------------------------------------------------------------------------------*/
//ed2k链接有三种
//1. 用来标识一个文件 : ed2k://|file|<文件名称>|<文件大小>|<文件哈希值>|...
//2. 用来标识一个服务器:ed2k://|server|...
//3. 用来标识一个服务器列表:ed2k://|serverlist|...
#ifndef _EMULE_ED2K_LINK_H_
#define _EMULE_ED2K_LINK_H_

#include "emule_struct_define.h"

#endif


